Revit 2024 API
TriangulatedShellComponent Members
The TriangulatedShellComponent type exposes the following members.
Methods
Name | Description
Clear
 Empties the contents of this TriangulatedShellComponent.
Dispose
Releases all resources used by the TriangulatedShellComponent
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetTriangle
 Returns the triangle corresponding to the given index.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetVertex
 Returns the vertex with a given index.
GetVertices
 Returns the vertices of the triangulation.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsClosed
 True if and only if the triangulation represents a topologically closed shell (i.e., each edge is shared by two triangles).
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TriangleCount
 The number of triangles in the triangulation.
VertexCount
 The number of vertices in the triangulation.
See Also
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace